package HW7_Inheritance;
/*Базируюсь на иерархии классов Employee->Programmer,QA создать у базового класса 1 конструктор со
всеми параметрами, и для каждого дочернего класса 2 консрукторы, в одном будет ссылка на супер класс,
в другом будут инициализироваться все поля каждого класса. Добавить общие методы и уникальные методы
 для каждого сабкласса. Не забудьте про абстрактные методы. Пересмотрите еще раз то что проходили на лекции.
*/

public class Task1 {
    QA qa = new QA(23,"Sam",30,5000,"male",Address address,"Junior","Web Service B&M","Washington",10);



}
